#ifndef HARDWARE_H__15_05_2009__14_35
#define HARDWARE_H__15_05_2009__14_35
  
#include <types.h>

#include "hw_conf.h"


//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//struct  ReqDsp05 { u16 rw; u16 crc; };												// запрос контрольной суммы и длины программы во флэш-памяти
//struct  ReqDsp06 { u16 rw; u16 stAdr; u16 len; byte data[256]; u16 crc; };			// запись страницы во флэш
//struct  ReqDsp07 { u16 rw; word crc; };												// перезагрузить блэкфин
//
//struct  RspDsp05 { u16 rw; u16 flashLen; u32 startAdr; u16 flashCRC; u16 crc; };	// запрос контрольной суммы и длины программы во флэш-памяти
//struct  RspDsp06 { u16 rw; u16 res; u16 crc; };										// запись страницы во флэш

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

extern void InitHardware();
extern void UpdateHardware();

//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++


#endif // HARDWARE_H__15_05_2009__14_35
